<a href="https://colab.research.google.com/github/tn610582/DataScience/blob/master/MovieLens_1M_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## MovieLens 1M Dataset 

### MovieLens 1M movie ratings. Stable benchmark dataset. 1 million ratings from 6000 users on 4000 movies. Released 2/2003.

[Link](https://grouplens.org/datasets/movielens/1m/) 
<br>[Readme file](http://files.grouplens.org/datasets/movielens/ml-1m-README.txt)

anaconda command:
  dataset directory: D:\DataScience\MovieLens 1M Dataset\ml-1m>

In [0]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
import pandas as pd
import numpy as np

In [0]:
#Load data from google drive
FILE_PATH = "/content/drive/My Drive/Colab Notebooks/DataScience_Project/MovieLens Dataset/ml-1m/"

### Load 3 Datasets

In [0]:
unames = ['user_id', 'gender','age','occupation','zip']
users = pd.read_csv(FILE_PATH+'users.dat',sep='::',header=None, names=unames, engine='python')

rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_csv(FILE_PATH+'ratings.dat',sep='::',header=None, names=rnames, engine='python')

mnames = ['movie_id', 'title', 'gerns']
movies = pd.read_csv(FILE_PATH+'movies.dat', sep='::', header=None, names=mnames, engine='python')

In [0]:
users[0:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [0]:
ratings[0:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [0]:
movies[0:5]

   movie_id                               title                         gerns
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [0]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000209 entries, 0 to 1000208
Data columns (total 4 columns):
user_id      1000209 non-null int64
movie_id     1000209 non-null int64
rating       1000209 non-null int64
timestamp    1000209 non-null int64
dtypes: int64(4)
memory usage: 30.5 MB

###Combine all 3 datasets together

In [0]:
data = pd.merge(pd.merge(ratings, users),movies)

In [0]:
data[0:1]

   user_id  movie_id  ...                                   title  gerns
0        1      1193  ...  One Flew Over the Cuckoo's Nest (1975)  Drama

[1 rows x 10 columns]

In [0]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000209 entries, 0 to 1000208
Data columns (total 10 columns):
user_id       1000209 non-null int64
movie_id      1000209 non-null int64
rating        1000209 non-null int64
timestamp     1000209 non-null int64
gender        1000209 non-null object
age           1000209 non-null int64
occupation    1000209 non-null int64
zip           1000209 non-null object
title         1000209 non-null object
gerns         1000209 non-null object
dtypes: int64(6), object(4)
memory usage: 83.9+ MB

In [0]:
data.loc[0]

user_id                                            1
movie_id                                        1193
rating                                             5
timestamp                                  978300760
gender                                             F
age                                                1
occupation                                        10
zip                                            48067
title         One Flew Over the Cuckoo's Nest (1975)
gerns                                          Drama
Name: 0, dtype: object

### Calculate average ratings for each movie by gender

In [0]:
mean_ratings = data.pivot_table('rating', index=['title'],columns='gender', aggfunc=np.mean)

In [0]:
mean_ratings[0:5]

gender                                    F         M      diff
title
'burbs, The (1989)                 2.793478  2.962085  0.168607
10 Things I Hate About You (1999)  3.646552  3.311966 -0.334586
101 Dalmatians (1961)              3.791444  3.500000 -0.291444
101 Dalmatians (1996)              3.240000  2.911215 -0.328785
12 Angry Men (1957)                4.184397  4.328421  0.144024

### Filter out movies that have less that 250 ratings

In [0]:
ratings_by_title = data.groupby('title').size()

In [0]:
print(np.shape(ratings_by_title))
ratings_by_title[0:10]

(3706,)

title
$1,000,000 Duck (1971)                37
'Night Mother (1986)                  70
'Til There Was You (1997)             52
'burbs, The (1989)                   303
...And Justice for All (1979)        199
1-900 (1994)                           2
10 Things I Hate About You (1999)    700
101 Dalmatians (1961)                565
101 Dalmatians (1996)                364
12 Angry Men (1957)                  616
dtype: int64

In [0]:
active_titles = ratings_by_title.index[ratings_by_title >= 250]

In [0]:
np.shape(active_titles)
active_titles

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)', '12 Angry Men (1957)',
       '13th Warrior, The (1999)', '2 Days in the Valley (1996)',
       '20,000 Leagues Under the Sea (1954)', '2001: A Space Odyssey (1968)',
       '2010 (1984)',
       ...
       'X-Men (2000)', 'Year of Living Dangerously (1982)',
       'Yellow Submarine (1968)', 'You've Got Mail (1998)',
       'Young Frankenstein (1974)', 'Young Guns (1988)',
       'Young Guns II (1990)', 'Young Sherlock Holmes (1985)',
       'Zero Effect (1998)', 'eXistenZ (1999)'],
      dtype='object', name='title', length=1216)

In [0]:
mean_ratings = mean_ratings.loc[active_titles]

In [0]:
print(np.shape(mean_ratings))
mean_ratings[0:5]

(1216, 3)

gender                                    F         M      diff
title
'burbs, The (1989)                 2.793478  2.962085  0.168607
10 Things I Hate About You (1999)  3.646552  3.311966 -0.334586
101 Dalmatians (1961)              3.791444  3.500000 -0.291444
101 Dalmatians (1996)              3.240000  2.911215 -0.328785
12 Angry Men (1957)                4.184397  4.328421  0.144024

###Get the top femail ratings of the movies

In [0]:
top_female_ratings = mean_ratings.sort_values(by='F', ascending=False)

In [0]:
top_female_ratings[0:5]

gender                                                     F         M
title
Close Shave, A (1995)                               4.644444  4.473795
Wrong Trousers, The (1993)                          4.588235  4.478261
Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)       4.572650  4.464589
Wallace & Gromit: The Best of Aardman Animation...  4.563107  4.385075
Schindler's List (1993)                             4.562602  4.491415

###Calculate the difference between two different genders

In [0]:
mean_ratings['diff'] = mean_ratings['M']- mean_ratings['F']

####Sort to get most liked movie by females

In [0]:
sorted_by_diff = mean_ratings.sort_values(by='diff')

In [0]:
sorted_by_diff[0:5]

gender                            F         M      diff
title
Dirty Dancing (1987)       3.790378  2.959596 -0.830782
Jumpin' Jack Flash (1986)  3.254717  2.578358 -0.676359
Grease (1978)              3.975265  3.367041 -0.608224
Little Women (1994)        3.870588  3.321739 -0.548849
Steel Magnolias (1989)     3.901734  3.365957 -0.535777

####Sort for males

In [0]:
sorted_by_diff[::-1][:5]

gender                                         F         M      diff
title
Good, The Bad and The Ugly, The (1966)  3.494949  4.221300  0.726351
Kentucky Fried Movie, The (1977)        2.878788  3.555147  0.676359
Dumb & Dumber (1994)                    2.697987  3.336595  0.638608
Longest Day, The (1962)                 3.411765  4.031447  0.619682
Cable Guy, The (1996)                   2.250000  2.863787  0.613787